[{"title": "Abertura PyJamas Conf 2019", "description": "Abertura oficial", "speaker": "Pyjamas Org Team", "email": "pyjamasconf@gmail.com", "datetime": "2019-12-02T16:40:00.000", "duration": "30", "embed_link": "", "link": "https://www.youtube.com/watch?v=rqGjsCb6-OU"}, {"title": "Mantendo a documentação do Python em Português!", "description": "Em 2019, depois de muito esforço de várias pessoas voluntárias, publicamos no site oficial da documentação do Python as traduções em Português. Porém, isso não quer dizer que o trabalho com as traduções diminuiu, muito pelo contrário. Nessa palestras vou mostrar como é o processo de traduções da documentação, como você pode aprender Python traduzindo, e como contribuir para essa iniciativa mesmo sem saber inglês.", "speaker": "Marco Rougeth", "email": "pyjamas@rougeth.com", "datetime": "2019-12-02T16:40:00.000", "duration": "20", "embed_link": "", "link": "https://Youtube.com/c/pyjamasconf"}, {"title": "Django em Docker", "description": "Como correr uma aplicação Django em Docker ", "speaker": "Tiago Carreira", "email": "tiago.g.carreira.br@gmail.com", "datetime": "2019-12-02T16:40:00.000", "duration": "45", "embed_link": "", "link": "https://Youtube.com/c/pyjamasconf"}, {"title": "Live Coding: Entregando mais e mais rápido com o ERP de código aberto Odoo", "description": "O Odoo é um ERP de código aberto sensacional: Python + Javascript + PostgreSQL. E com diversos módulos que podem agregar valor instantaneamente, assim como poupar você de escrever muito código.\n\nCom um framework similar ao DJANGO, vou mostrar como escrever um módulo de serviço ao atendimento ao consumidor, SAC, em poucos minutos. Com integração com email, kanban, automações e se der tempo ainda integrar com SMS e Email marketing.", "speaker": "Luis Felipe Mileo", "email": "mileo@kmee.com.br", "datetime": "2019-12-02T16:40:00.000", "duration": "60", "embed_link": "", "link": "https://youtu.be/lwT9nEBdPR8"}, {"title": "Hello World: Criando uma infraestrutura escalável", "description": "Construindo uma infraestrutura básica em Nuvem. Desde a criação ", "speaker": "Josué Junior", "email": "phibos@gmail.com", "datetime": "2019-12-02T16:40:00.000", "duration": "30", "embed_link": "", "link": "http://YouTube.com/phibos01"}, {"title": "Engenharia de Qualidade com Python", "description": "Quer saber mais o que seria Engenharia de Qualidade? Quer saber como Python pode te ajudar a garantir a qualidade dos seus sistemas? Então chega mais nesse bate-papo onde o Elyézer Rezende e o Og Maciel vão compartilhar suas experiências tanto do lado técnico quanto do lado de contratar Engenheiros de Qualidade. Com isso, esperamos que você tenha uma visão melhor do que seria um Engenheiro de Qualidade, quais as ferramentas em Python que poderia te ajudar a testar seus sistemas e como se preparar para uma vaga de Engenharia de Qualidade. ", "speaker": "Castálio Podcast", "email": "castalio.podcast@gmail.com", "datetime": "2019-12-02T16:40:00.000", "duration": "90", "embed_link": "", "link": "https://youtu.be/WiRCxvZfzEY"}, {"title": "Arquitetura de um Projeto Flask", "description": "Como organizar a estrutura de um projeto flask. Extensões, Blueprints, Configurações.", "speaker": "Bruno Rocha", "email": "rochacbruno@gmail.com", "datetime": "2019-12-02T16:40:00.000", "duration": "60", "embed_link": "", "link": "https://youtu.be/6mhTm6Luyhk"}, {"title": "Criando bots pra telegram usando python", "description": "Usando telebot pra automatizar um bot no telegram pra ajudar a manter um grupo, ou fazer broadcast de notícias, ou mesmo criar algo divertido.", "speaker": "Helio Loureiro", "email": "helio@loureiro.eng.br", "datetime": "2019-12-02T16:40:00.000", "duration": "60", "embed_link": "", "link": "https://www.youtube.com/watch?v=QL1CcFOK0Uw"}, {"title": "Conhecendo a biblioteca de Reconhecimento Facial linguagem Python", "description": "A pylestra tem como objetivo apresentar os métodos da biblioteca Face Recognition da linguagem de programação Python e demonstrar, por meio de exemplos práticos e interativos, a utilização destes métodos para implementar as técnicas de Reconhecimento Facial.", "speaker": "Giovana de Lucca", "email": "giovanaodelucca@gmail.com", "datetime": "2019-12-02T16:40:00.000", "duration": "60", "embed_link": "", "link": "https://Youtube.com/c/pyjamasconf"}, {"title": "Informação Salva: Python ajudando a entender um problema silencioso de saúde pública no Brasil e no mundo, o Suicídio. ", "description": "Segundo a OMS (Organização Mundial de Saúde), a prevenção de qualquer doença, morbidade ou patologia só é possível com informação. Cerca 90% dos casos de suicídio podem ser prevenidos, pois estão associado a psicópatologias como: depressão, transtorno bipolar, ansiedade, síndrome do pânico, que são diagnosticáveis.\n\nNa palestra em questão toda parte de captura, conversão e análise dos dados é feita em Python, baseados em dados abertos. Será apresentado através da análise dos dados um panorama geral do suícidio no Brasil e no mundo, como podemos quebrar esse tabu e combater esse problema de saúde pública mundial.", "speaker": "Marcelo Andriolli", "email": "marcelorsa@gmail.com", "datetime": "2019-12-02T16:40:00.000", "duration": "30", "embed_link": "", "link": "https://youtu.be/dMplCkeqnUw"}, {"title": "Teste de Hipóteses com Python", "description": "Testes estatísticos utilizando conceitos simples de amostragem e simulação estocástica usando funções e visualizações escritas em Python. Dados baixados de um repositório sueco. Um passeio por Pandas, Matplotlib e Python puro. ", "speaker": "Maykon Schots", "email": "maykonschots@gmail.com", "datetime": "2019-12-02T16:40:00.000", "duration": "45", "embed_link": "", "link": "https://Youtube.com/c/pyjamasconf"}, {"title": "Analisando queries do Django!", "description": "Você se preocupa com o volume de consulta no banco de dados da sua aplicação? Nessa palestra veremos os cuidados que temos que tomar ao fazer uma consulta no banco de dados utilizando o ORM do Django. Nosso banco é fundamental e temos que cuidar bem dele! :)", "speaker": "Rafael Galleani", "email": "rafegal@gmail.com", "datetime": "2019-12-02T16:40:00.000", "duration": "40", "embed_link": "", "link": "https://youtube.com/c/RafaelGalleani"}, {"title": "Por que usamos Python?", "description": "Bate Papo onde Moacir e Renzo abordam porque trabalham com Python, quais as vantagens.", "speaker": "Renzo", "email": "renzo@python.pro.br", "datetime": "2019-12-02T16:40:00.000", "duration": "50", "embed_link": "", "link": "https://youtube.com/devprofissional"}, {"title": "Python - Iniciantes", "description": "O objetivo é ter um primeiro contato com a linguagem Python e suas funcionalidades.", "speaker": "Cristiano Marques", "email": "cristianomarquesadm03@gmail.com", "datetime": "2019-12-02T16:40:00.000", "duration": "35", "embed_link": "", "link": "https://Youtube.com/c/pyjamasconf"}, {"title": "Não seja apenas um programador", "description": "O mercado de T.I. está muito aquecido e tem vagas sobrando pra todo lado, mas você sabia que focar exclusivamente em suas habilidades técnicas(conhecidas como hard skills) e deixar para o segundo plano suas habilidades de comunicação, negociação, senso de dono e diversos outros pontos chave que são chamados de soft skills, pode fazer toda a diferença na hora de conquistar aquele tão desejado emprego, promoção ou até mesmo uma sociedade?", "speaker": "Elton Lima", "email": "eltonplima@gmail.com", "datetime": "2019-12-02T16:40:00.000", "duration": "60", "embed_link": "", "link": "https://youtu.be/DE-SACLASmk"}, {"title": "Introdução a Arquitetura do Django", "description": "Live transmitida para o PyJamas. https://pyjamas.live\nVocê sabe como funciona a arquitetura do Django e os recursos que ele oferece?\nO Django é um dos mais populares frameworks web em Python.\nQue tal conhecer essa poderosa ferramenta e os seus recursos?", "speaker": "Regis Santos", "email": "regis.santos.100@gmail.com", "datetime": "2019-12-02T16:40:00.000", "duration": "80", "embed_link": "", "link": "https://www.youtube.com/c/regis-do-python"}, {"title": "Escrevendo um bot do telegram em Python para a comunidade PythOnRio", "description": "A ideia desse live stream é unir o útil ao agradável e fazer um bot em conjunto para   acionar regras, código de conduta e boas vindas para novos membros no grupo.\nPodemos usar algo pronto, mas é mais divertido construirmos algo juntos :)", "speaker": "Bianca Rosa", "email": "me@biancarosa.com.br", "datetime": "2019-12-02T16:40:00.000", "duration": "50", "embed_link": "", "link": "https://Youtube.com/c/pyjamasconf"}, {"title": "Automatizando tarefas com Python", "description": "Nesta palestra irei demonstrar como programação pode ser útil para pessoas que não são programadores profissionais, demonstrando pequenas ferramentas que criei para automatizar tarefas maçantes. ", "speaker": "Thiago Dias", "email": "thiago76ers@gmail.com", "datetime": "2019-12-02T16:40:00.000", "duration": "60", "embed_link": "", "link": "https://m.youtube.com/channel/UCG_GH22KoZYifrH7HJtoz4g"}, {"title": "Estruturas de Dados (com python) são (mais) legais", "description": "O objetivo desta palestra é mostrar rapidamente conceitos sobre estruturas de dados (listas, pilhas, filas, deques, dicionarios, arvores e grafos)\n\nE apresentar LIVE CODING algumas implementações, exemplos de situações onde usar e como o uso da estrutura ideal pode melhorar muito a performance de vários códigos.\n\nIsso tudo usando JUST PYTHON.", "speaker": "Tyrone Damasceno", "email": "tyronedamasceno@gmail.com", "datetime": "2019-12-02T16:40:00.000", "duration": "40", "embed_link": "", "link": "https://Youtube.com/c/pyjamasconf"}, {"title": "Python e os seus frameworks web", "description": "Quer programar para Web utilizando Python ? \n\nPor onde devo começar ? Qual melhor framework ? Qual a diferença entre eles ?\n", "speaker": "Jefferson Almeida", "email": "jralmeida88@gmail.com", "datetime": "2019-12-02T16:40:00.000", "duration": "30", "embed_link": "", "link": "https://Youtube.com/c/pyjamasconf"}, {"title": "Data Science: É de comer?", "description": " Fazendo uma pesquisa rápida no Google é possível encontrar, aproximadamente, 1.490.000.000 resultados sobre o termo. Mas o que será que ele realmente significa?\n\nTaxada como a profissão do futuro, o data scientist é quase como um unicórnio na programação: ninguém viu, mas todo mundo gostaria de ter um. Foi até nomeada como \"A profissão mais sexy do século XXI\" pela Harvard Business Review.\n\nNessa palestra, trago informações concretas explicando o que é a Ciência de Dados, como se tornar profissional na área (ou se descobrir uma), e de maneira é possível fazer uma trilha de estudos sobre o tema e aprofundar-se no mesmo.", "speaker": "Letícia Silva", "email": "leticiadasilva.contato@gmail.com", "datetime": "2019-12-02T16:40:00.000", "duration": "40", "embed_link": "", "link": "https://www.youtube.com/channel/UCywxFahcIZtnrLFXgFuGHqw/"}, {"title": "Organizando sua análise de dados com Snakemake", "description": "Projetos de análises de dados tendem a começar com uma tarefa pequena: baixar um arquivo, limpar dados brutos, gerar uma figura. Notebooks são ótimas ferramentas para exploração, mas o que fazer quando você tem centenas (ou milhares) de arquivos, e precisa repetir esse processo para cada um deles?\n\nSnakemake é uma ferramenta para gerenciamento de workflows, com uma sintaxe parecida com Makefiles mas com muitas outras funcionalidades úteis:\n  - gerenciamento de software (usando conda)\n  - submissão de tarefas para clusters\n  - medição de recursos utilizados\n\nE, principalmente: snakemake é Python, e você pode usar qualquer pacote ou definir suas próprias funções para guiar a sua análise!", "speaker": "Luiz Irber", "email": "contact+pyjamas@luizirber.org", "datetime": "2019-12-02T16:40:00.000", "duration": "30", "embed_link": "", "link": "https://Youtube.com/c/pyjamasconf"}, {"title": "Django ORM vs SQLAlchemy", "description": "15 Exemplos lado a lado de consultas com o ORM do Django e do SQLAlchemy. Um bate papo das vantagens e desvantagens de cada um.", "speaker": "Roger Camargo", "email": "huogerac@gmail.com", "datetime": "2019-12-02T16:40:00.000", "duration": "25", "embed_link": "", "link": "https://www.youtube.com/user/huogerac"}, {"title": "Desenvolvimento de aplicações web seguras", "description": "No cenário de desenvolvimento web, pouco se é falado sobre segurança, ou boas práticas para desenvolvimento de aplicações web de forma segura. Nessa talk, pretendo falar sobre as principais vulnerabilidades que afetam aplicações web e como você como desenvolvedor pode assegurar que sua aplicação Python está segura.", "speaker": "Tarcísio Marinho", "email": "tarcisio_marinho09@hotmail.com", "datetime": "2019-12-02T16:40:00.000", "duration": "60", "embed_link": "", "link": "https://Youtube.com/c/pyjamasconf"}, {"title": "Transição profissional - front", "description": "Conheci django com o cadu.. mas ainda nao tenho habilidade com ele..\nNão trabalho na área de TI (nunca trabalhei).. \nQuando fiz o tcc de analise e desenvolvimento de sistemas (automação) percebi que queria trabalhar na área.. era isso que eu queria.. Atualmente curso Ciência e tecnologia na unifesp.. \nEstou fazendo meu primeiro trabalho front end e talvez com um segundo a caminho ( meu namorado (desenvolvedor abap) e eu fomos viajar e voltamos com a tarefa de mandar algo para o dono da pousada que ficamos, um site e banco de dados.\nNão é relacionado a python.. mas talvez ajude alguem que esteja na dúvida de que caminho seguir.. front, back, etc", "speaker": "Cristina Ribeiro", "email": "cristicribeiro@gmail.com", "datetime": "2019-12-02T16:40:00.000", "duration": "20", "embed_link": "", "link": "https://Youtube.com/c/pyjamasconf"}, {"title": "Meu primeiro projeto usando TDD", "description": "Muitas perguntas surgem quando falamos sobre TDD, não sabemos como fazer os testes iniciais, não sabemos até que ponto devemos testar o código inicial. A ideia dessa palestra é mostrar como iniciar um projeto python usando TDD.", "speaker": "Eduardo Mendes", "email": "mendesxeduardo@gmail.com", "datetime": "2019-12-02T16:40:00.000", "duration": "50", "embed_link": "", "link": "http://youtube.com/c/eduardomendes"}, {"title": "Game Domain Development", "description": "Você vai aprender a desenvolver toda a lógica de um jogo que pode ser plugado em virtualemente qualquer interface.\nUse o desenvolvimento de jogos para treina orientação a objetos com Python e usar as coisas mais legais da liguaguem e suas baterias incluídas.\nAprenda o que é o domínio de um jogo, Stages, Jogadores, IAs, etc.", "speaker": "Eduardo Stalinho", "email": "eduardooc.86@gmail.com", "datetime": "2019-12-02T16:40:00.000", "duration": "30", "embed_link": "", "link": "https://Youtube.com/c/pyjamasconf"}, {"title": "meu primeiro pacote python completo e profissional", "description": "Ok, você já aprendeu a fazer scripts, mas como empacotar e deixar mais profissional?\nVamos a começar do zero, criar o venv, instalar as ferramentas basicas, e ir passo a passo até conseguir criar um pacote, com CLI, pronto para subir no pypi com testes, CI e dockerizado", "speaker": "Juan Funez", "email": "juan.funez@gmail.com", "datetime": "2019-12-02T16:40:00.000", "duration": "60", "embed_link": "", "link": "https://Youtube.com/c/pyjamasconf"}, {"title": "Python em 20 minutos", "description": "Nessa conversa, mostrarei a sintaxe da linguagem Python e alguns passos para que o iniciante obtenha mais conhecimento na linguagem ", "speaker": "Lucas Lima da Silva", "email": "lukesilva.dev@gmail.com", "datetime": "2019-12-02T16:40:00.000", "duration": "20", "embed_link": "", "link": "https://www.youtube.com/channel/UCv6KLlnNe4TdV_FEDN_iIYw"}, {"title": "Inserção das Mulheres na TI nos últimos 10 anos - Análise de dados com Pandas", "description": "Análise de dados do Censo da Educação Superior - INEP, utilizando a biblioteca Pandas no jupyter notebook, para verificar o número de mulheres inseridas nos cursos de TI nos anos de  2009 à 2018.", "speaker": "Ariana Cursino", "email": "arcursino@gmail.com", "datetime": "2019-12-02T16:40:00.000", "duration": "30", "embed_link": "", "link": "https://Youtube.com/c/pyjamasconf"}, {"title": "Criando um bot no discord com Python ", "description": "Mostrarei como criar um bot para discord em Python", "speaker": "Lucas Lima da Silva", "email": "lukesilva.dev@gmail.com", "datetime": "2019-12-02T16:40:00.000", "duration": "30", "embed_link": "", "link": "https://www.youtube.com/channel/UCv6KLlnNe4TdV_FEDN_iIYw"}, {"title": "Python Com Delphi CE", "description": "Como integrar o Python dentro da IDE gratuita do Delphi (Delphi Community Edition)", "speaker": "Ricardo da Rocha", "email": "ricardodarocha@outlook.com", "datetime": "2019-12-02T16:40:00.000", "duration": "30", "embed_link": "", "link": "https://Youtube.com/c/pyjamasconf"}, {"title": "Introdução a Raspagem de Dados com Python e Scrapy", "description": "O Scrapy é uma das bibliotecas de scraping mais populares e poderosas do Python, com \"baterias inclusas\" ela de fornece um leque de funcionalidades comuns em quase todos os scrapers precisam ter, evitando assim que você precise reinventar a roda.\n\nA ideia dessa palestra explanar a respeito dos fundamentos de scraping e spidering, com exemplos reais utilizando o scrapy, explicando com funciona seu fluxo e mostrando como é fácil capturar dados na internet.", "speaker": "Werberth Vinícius", "email": "werberthvinicius@gmail.com", "datetime": "2019-12-02T16:40:00.000", "duration": "30", "embed_link": "", "link": "https://Youtube.com/c/pyjamasconf"}, {"title": "Automação de Testes na Prática com Python Selenium", "description": "Apresentar os primeiros passos para criar scripts de testes automatizados utilizando Python e Selenium,minha ideia é falar um pouco também de BDD utilizando o Behave.\n** Gostei bastante da ideia de gravar a live e disponibilizar por 24 horas, pois não sei se terei disponibilidade de gravar ao vivo na data.\n", "speaker": "João Victor Barreto", "email": "joaovictor.hts@gmail.com", "datetime": "2019-12-02T16:40:00.000", "duration": "40", "embed_link": "", "link": "https://m.youtube.com/channel/UCB5vNpKjQLDbcxAZht8ombg"}, {"title": "Function as a Service no OpenFaaS com Docker e Python", "description": "Com o OpenFaaS é muito simples transformar qualquer coisa em uma function as a service que é executada no Linux ou Windows através do Docker Swarm ou Kubernetes. Além disso o OpenFaaS já possui um portal onde você pode implementar novas funções e verificar as métricas de suas funções. Aproveitando a facilidade e poder da linguagem Python, podemos fazer muita coisa usando essa ferramenta.", "speaker": "Rodrigo \"pokemaobr\"", "email": "contato@pokemaobr.dev", "datetime": "2019-12-02T16:40:00.000", "duration": "60", "embed_link": "", "link": "https://www.twitch.tv/pokemaobr"}, {"title": "Um dia, um código em Python vai corrigir uma redação do Enem", "description": "Vamos mostrar como a facilidade que Python proporciona a iniciantes e pesquisadores de áreas de Humanas pode auxiliar na produção de programas de utilidade para a comunidade. Um protótipo de correção automática de redações será apresentado, com foco no retorno ao usuário sobre as Competências 1 e 4.", "speaker": "Ricardo Joseh Lima", "email": "rjlimauerj@gmail.com", "datetime": "2019-12-02T16:40:00.000", "duration": "15", "embed_link": "", "link": "https://Youtube.com/c/pyjamasconf"}, {"title": "Nuitka - E se Python fosse compilada?", "description": "Embora a linguagem Python seja poderosa e uma das mais usadas, a velocidade de execução não é um dos atrativos da linguagem. Com Nuitka, um compilador Python, este estigma de linguagem lenta pode acabar. Esta apresentação visa mostrar o estágio de desenvolvimento atual do Nuitka, suas limitações e o que podemos esperar deste compilador.", "speaker": "Nilo Menezes", "email": "nilo.menezes@gmail.com", "datetime": "2019-12-02T16:40:00.000", "duration": "30", "embed_link": "", "link": "https://youtu.be/IYv4rSOD5Tw"}, {"title": "Desenvolvendo de interfaces gráficas em PyQt5", "description": "Nessa Live, irei ensinar os primeiros passos para fazer uma calculadora completa com PyQt5 ", "speaker": "Gregorio Honorato", "email": "greghono@gmail.com", "datetime": "2019-12-02T16:40:00.000", "duration": "50", "embed_link": "", "link": "https://youtu.be/VWqju44Mt-4"}, {"title": "Python + Power BI, uma análise sobre o ENEM 2018", "description": "Nessa palestra mostrarei como trabalhar com Python como ferramenta de ETL, extraindo os dados do Enem 2018, realizando todo o tratamento e em seguida passando os dados para uma ferramenta de visualização de dados( Power BI) para mostrar os insights que podemos extrair  da base.", "speaker": "Fernanda Santos", "email": "ftspublicidade@gmail.com", "datetime": "2019-12-02T16:40:00.000", "duration": "30", "embed_link": "", "link": "https://Youtube.com/c/pyjamasconf"}, {"title": "Fazendo Analise de dados SÓ com Python (Just Python)", "description": "Vamos fazer uma pequena demonstração.... vamos analisar o dataset do naufrágio do Titanic somente com Python sem utilizar nenhuma lib ou framework\n\nExplicando como podemos organizar, alinhar, deletar dentre outras funcionalidade.\n\nAssim deixando com curiosidade para conhecer ou como funcionam as famosas bibliotecas de análise de dados em python, e tambem conhecer mais sobre o que vc pode fazer somente com python.\n", "speaker": "Cesar Bruschetta", "email": "cesarabruschetta@gmail.com", "datetime": "2019-12-02T16:40:00.000", "duration": "30", "embed_link": "", "link": "https://Youtube.com/c/pyjamasconf"}, {"title": "Rodando uma API com Django Rest Framework no Google Cloud", "description": "Será mostrado uma aplicação de demonstração em IoT para monitorar o nível de tanques em uma fazenda. Será construída uma API com Django Rest Framework, salvando os dados básicos no Cloud SQL e dados de telemetria dos dispositivos no BigQuery. Tudo isso rodando em ambiente serveless no Google Cloud, sem ter que se queimar configurando servidores. Também veremos o básico de um dispositivo IoT para este projeto feito com MicroPython. ", "speaker": "Alvaro Viebrantz", "email": "alvarowolfx@gmail.com", "datetime": "2019-12-02T16:40:00.000", "duration": "40", "embed_link": "", "link": "https://www.youtube.com/user/alvarofellipe"}, {"title": "Como o maior Django Girls do mundo mudou a minha vida", "description": "Como a importância de eventos de tecnologia exclusivos para mulheres, e com espaço para mães, mudou a minha vida na comunidade da TI.", "speaker": "Aline Bastos", "email": "alineabp@gmail.com", "datetime": "2019-12-02T16:40:00.000", "duration": "30", "embed_link": "", "link": "https://www.youtube.com/channel/UCjXL44YbiOb1hdSwVq51VCw"}, {"title": "Explorando Dados Com Python e Pandas", "description": "O curso é uma introdução de exploração de dados usando python e Pandas", "speaker": "Alexandre Lopes", "email": "aleaugustoplus@gmail.com", "datetime": "2019-12-02T16:40:00.000", "duration": "45", "embed_link": "", "link": "https://www.youtube.com/channel/UCOF4kWbxCbAwm1v8yHlbpRw"}, {"title": "Mudar de área aos 40. Pode isso Arnaldo?", "description": "Nessa palestra falarei sobre os percalços de se mudar de área aos 40 anos, e a importância da comunidade Python nessa transição", "speaker": "Fábio Serrão", "email": "fabioserrones@gmail.com", "datetime": "2019-12-02T16:40:00.000", "duration": "30", "embed_link": "", "link": "https://Youtube.com/c/pyjamasconf"}, {"title": "ScanAPI: Automatização de Testes de Integração para a sua API", "description": "A ScanAPI é uma biblioteca de código aberto que possibilita a criação de testes de integração para REST APIs.\n\nAtravés de um arquivo de configuração yaml, você consegue implementar testes automatizados para os endpoints da sua API. A biblioteca gera um relatório da execução dos testes que também pode ser utilizado como a própria documentação da API,\n\nA biblioteca ainda está em fase de desenvolvimento. Essa palestra visa mostrar um pouco do funcionamento da ScanAPI, discutir os próximos passos a serem implementados e também divulgar a ferramenta para quem possa ter interesse, seja para sua utilização ou contribuição com o projeto.\n\nLink do projeto: https://github.com/camilamaia/scanapi", "speaker": "Camila Maia", "email": "cmaiacd@gmail.com", "datetime": "2019-12-02T16:40:00.000", "duration": "30", "embed_link": "", "link": "https://Youtube.com/c/pyjamasconf"}, {"title": "Gerando uma API automaticamente", "description": "Tens uma aplicação legada ou uma API em produção e quer migrar para Django REST Framework? Sem escrever uma linha de código vamos gerar automaticamente a estrutura dos models, views, serializers e rotas a partir do banco de dados.", "speaker": "Leonardo Gregianin", "email": "leogregianin@gmail.com", "datetime": "2019-12-02T16:40:00.000", "duration": "30", "embed_link": "", "link": "https://www.youtube.com/channel/UCI76AtUUJGThQx9p4Ke97wg"}, {"title": "Anti-patterns - o que são e como se livrar deles em Python", "description": "Nessa apresentação serão apresentados diversos casos de anti-patterns ao se programar em Python e quais são as maneiras corretas de solucioná-los. A palestra é fortemente baseada no livro \"The Little Book of Python Anti-Patterns\", mas não se limita somente à essa publicação.", "speaker": "Caio Carrara", "email": "eu@caiocarrara.com.br", "datetime": "2019-12-02T16:40:00.000", "duration": "30", "embed_link": "", "link": "https://Youtube.com/c/pyjamasconf"}, {"title": "Micro-serviço em 7 linhas!", "description": "Vamos conversar sobre o Chalice, um MicroFramework da AWS de python para micro-serviços de uma forma bem simples e descomplicada. ", "speaker": "James Peres", "email": "james.peres.s@gmail.com", "datetime": "2019-12-02T16:40:00.000", "duration": "30", "embed_link": "", "link": "https://Youtube.com/c/pyjamasconf"}, {"title": "Encerramento Pyjamas Conf 2019", "description": "Encerramento oficial", "speaker": "Pyjamas Org Team", "email": "pyjamasconf@gmail.com", "datetime": "2019-12-02T16:40:00.000", "duration": "30", "embed_link": "", "link": "https://youtube.com/pyjamasconf"}]